# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Plane..::..Origin Property
Plane Class See Also
---
Plane origin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# See Also
Plane Class
Autodesk.Revit.DB Namespace